Tekla Open API Reference for Tekla Structures 2025
WorkPlaneHandler.SetCurrentTransformationPlane Method
 Sets the current transformation plane.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetCurrentTransformationPlane(
	TransformationPlane TransformationPlane
)
Public Function SetCurrentTransformationPlane (
	TransformationPlane As TransformationPlane
) As Boolean
Parameters
TransformationPlane
Type: Tekla.Structures.Model.TransformationPlane
The transformation plane to be set as the current transformation plane.
Return Value
Type: Boolean
False on failure.
Remarks
 Please note that in order to see workplane change visible in the model, use the RedrawWorkplane() method of the ViewHandler class.
See Also
Reference
WorkPlaneHandler Class
Tekla.Structures.Model Namespace